План_полетов_файловый_edt/src/Documents/Прилеты/Прилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Прилеты</name>
  <registerRecords>AccumulationRegister.ДанныеПрилетов</registerRecords>
  <attributes>
    <name>ВылетИзКпПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВылетИзКпФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеРасчет</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>CatalogRef.ПричиныЗадержекПрилетаВылетаВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапаснойАП</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеНаЗапаснойАП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Регулярность</name>
    <type>
      <types>CatalogRef.ВидыПолета</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеприбытия</name>
    <type>
      <types>CatalogRef.ПричиныНеприбытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Неприбыл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КВС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АэропортВылета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>АэропортПрилета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>УходНаЗапаснойАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадержкаПрилета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВСуточныйПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

План_полетов_файловый_edt/src/InformationRegisters/СвязьДанныеСОППрилетВылет/СвязьДанныеСОППрилетВылет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьДанныеСОППрилетВылет</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VIPПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VIPПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПрилетВылет</name>
    <type>
      <types>DocumentRef.Прилеты</types>
      <types>DocumentRef.Вылеты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/Documents/Прилеты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	Стр = ДанныеРейса(Объект.Рейс);
	Если Стр.Успех Тогда 
		Объект.АэропортВылета = Стр.АэропортВылета;
		Объект.АэропортПрилета = Стр.АэропортПрилета;
		Элементы.АэропортВылета.Доступность = Ложь;
		Элементы.АэропортПрилета.Доступность = Ложь;		
	ИначеЕсли (не Стр.Успех) и (Стр.Код = -2) Тогда 
		Элементы.АэропортВылета.Доступность = Истина;
		Элементы.АэропортПрилета.Доступность = Истина;
		Элементы.АэропортВылета.ОтметкаНезаполненного = Истина;
		Элементы.АэропортПрилета.ОтметкаНезаполненного = Истина;
		Объект.АэропортВылета = Стр.АэропортВылета;
		Объект.АэропортПрилета = Стр.АэропортПрилета;
	Иначе 	
		Элементы.АэропортВылета.Доступность = Истина;
		Элементы.АэропортПрилета.Доступность = Истина;
		Элементы.АэропортВылета.ОтметкаНезаполненного = Истина;
		Элементы.АэропортПрилета.ОтметкаНезаполненного = Истина;
		Объект.АэропортВылета = Стр.АэропортВылета;
		Объект.АэропортПрилета = Стр.АэропортПрилета;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У рейса заполнен только 1 а/п. Должны быть заполнены либо оба, либо ни одного!";
		Сообщение.Поле = "Рейс";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция  ДанныеРейса(Рейс)
	Выборка = Новый Структура;
	Если (Рейс.АэропортВылета = Справочники.Аэропорты.ПустаяСсылка()) и (Рейс.АэропортПрилета = Справочники.Аэропорты.ПустаяСсылка()) Тогда 
		Выборка.Вставить("Успех", Ложь);
		Выборка.Вставить("Код", -2);
		Выборка.Вставить("АэропортПрилета", Справочники.Аэропорты.ПустаяСсылка());
		Выборка.Вставить("АэропортВылета", Справочники.Аэропорты.ПустаяСсылка());
	ИначеЕсли (Рейс.АэропортВылета = Справочники.Аэропорты.ПустаяСсылка()) или (Рейс.АэропортПрилета = Справочники.Аэропорты.ПустаяСсылка()) Тогда	
		Выборка.Вставить("Успех", Ложь);
		Выборка.Вставить("Код", -1);
		Выборка.Вставить("АэропортПрилета", Справочники.Аэропорты.ПустаяСсылка());
		Выборка.Вставить("АэропортВылета", Справочники.Аэропорты.ПустаяСсылка());
	Иначе 
		Выборка.Вставить("Успех", Истина);
		Выборка.Вставить("АэропортПрилета", Рейс.АэропортПрилета);
		Выборка.Вставить("АэропортВылета", Рейс.АэропортВылета);	
	КонецЕсли;
	Возврат Выборка;
КонецФункции	

&НаСервере
Процедура ПолучитьДанныеСОПНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязьДанныеСОППрилетВылет.ПассажирыВзрослые КАК ПассажирыВзрослые,
		|	СвязьДанныеСОППрилетВылет.ПассажирыДети КАК ПассажирыДети,
		|	СвязьДанныеСОППрилетВылет.ПассажирыМалыши КАК ПассажирыМалыши,
		|	СвязьДанныеСОППрилетВылет.РучнаяКладь КАК РучнаяКладь,
		|	СвязьДанныеСОППрилетВылет.Багаж КАК Багаж,
		|	СвязьДанныеСОППрилетВылет.Почта КАК Почта,
		|	СвязьДанныеСОППрилетВылет.Груз КАК Груз
		|ИЗ
		|	РегистрСведений.СвязьДанныеСОППрилетВылет КАК СвязьДанныеСОППрилетВылет
		|ГДЕ
		|	СвязьДанныеСОППрилетВылет.ПрилетВылет = &ПрилетВылет";
	
	Запрос.УстановитьПараметр("ПрилетВылет", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Диспетчер СОП еще не ввел данные по этому документу";
		Сообщение.Сообщить();
	Иначе 
		ВыборкаДетальныеЗаписи.Следующий();
		Объект.ПассажирыВзрослые = ВыборкаДетальныеЗаписи.ПассажирыВзрослые;
		Объект.ПассажирыДети = ВыборкаДетальныеЗаписи.ПассажирыДети;
		Объект.ПассажирыМалыши = ВыборкаДетальныеЗаписи.ПассажирыМалыши;
		Объект.Почта = ВыборкаДетальныеЗаписи.Почта;
		Объект.Груз = ВыборкаДетальныеЗаписи.Груз;
		Объект.РучнаяКладь = ВыборкаДетальныеЗаписи.РучнаяКладь;
		Объект.Багаж = ВыборкаДетальныеЗаписи.Багаж;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данные успешно загружены";
		Сообщение.Сообщить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеСОП(Команда)
	ПолучитьДанныеСОПНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СтруктураДанныхСОП = СравнитьДанныеСДаннымиСОП();
	
	Если СтруктураДанныхСОП.Свойство("ОтличаетсяОтДанныхСоп") Тогда 
		Если СтруктураДанныхСОП.ОтличаетсяОтДанныхСоп Тогда 
			Отказ = Истина;
			ЗадатьВопрос(СтруктураДанныхСОП);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СравнитьДанныеСДаннымиСОП() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязьДанныеСОППрилетВылет.ПассажирыВзрослые КАК ПассажирыВзрослые,
		|	СвязьДанныеСОППрилетВылет.ПассажирыДети КАК ПассажирыДети,
		|	СвязьДанныеСОППрилетВылет.ПассажирыМалыши КАК ПассажирыМалыши,
		|	СвязьДанныеСОППрилетВылет.РучнаяКладь КАК РучнаяКладь,
		|	СвязьДанныеСОППрилетВылет.Багаж КАК Багаж,
		|	СвязьДанныеСОППрилетВылет.Почта КАК Почта,
		|	СвязьДанныеСОППрилетВылет.Груз КАК Груз
		|ИЗ
		|	РегистрСведений.СвязьДанныеСОППрилетВылет КАК СвязьДанныеСОППрилетВылет
		|ГДЕ
		|	СвязьДанныеСОППрилетВылет.ПрилетВылет = &ПрилетВылет";
	
	Запрос.УстановитьПараметр("ПрилетВылет", объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура;
	
	Если не РезультатЗапроса.Пустой() Тогда 
		ВыборкаДетальныеЗаписи.Следующий();
		ОтличаетсяОтДанныхСоп = Ложь;
		Если (Объект.ПассажирыВзрослые <> ВыборкаДетальныеЗаписи.ПассажирыВзрослые) или (Объект.ПассажирыДети <> ВыборкаДетальныеЗаписи.ПассажирыДети)
			или (Объект.ПассажирыМалыши <> ВыборкаДетальныеЗаписи.ПассажирыМалыши) или (Объект.Почта <> ВыборкаДетальныеЗаписи.Почта) или (Объект.Груз <> ВыборкаДетальныеЗаписи.Груз)
			или (Объект.РучнаяКладь <> ВыборкаДетальныеЗаписи.РучнаяКладь)или (Объект.Багаж <> ВыборкаДетальныеЗаписи.Багаж) 
			Тогда
			ОтличаетсяОтДанныхСоп = Истина;
		КонецЕсли;
		СтруктураДанных.Вставить("ОтличаетсяОтДанныхСоп",ОтличаетсяОтДанныхСоп);
		Если ОтличаетсяОтДанныхСоп Тогда
			СтруктураДанных.Вставить("ПассажирыВзрослые",ВыборкаДетальныеЗаписи.ПассажирыВзрослые);
			СтруктураДанных.Вставить("ПассажирыДети",ВыборкаДетальныеЗаписи.ПассажирыДети);
			СтруктураДанных.Вставить("ПассажирыМалыши",ВыборкаДетальныеЗаписи.ПассажирыМалыши);
			СтруктураДанных.Вставить("Почта",ВыборкаДетальныеЗаписи.Почта);
			СтруктураДанных.Вставить("Груз",ВыборкаДетальныеЗаписи.Груз);
			СтруктураДанных.Вставить("РучнаяКладь",ВыборкаДетальныеЗаписи.РучнаяКладь);
			СтруктураДанных.Вставить("Багаж",ВыборкаДетальныеЗаписи.Багаж);
		КонецЕсли;		
	КонецЕсли;
	
	Возврат СтруктураДанных;
КонецФункции	

&НаКлиенте 
Процедура ЗадатьВопрос(Структура) 
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект, Структура); // Прописываем название процедуры-обработчика. 
	ПоказатьВопрос(Оповещение, "Изменить значения?", // вместо привычного "Вопрос", теперь "ПоказатьВопрос" 
	РежимДиалогаВопрос.ДаНет, 0, // задержка (секунды). необязательно 
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно 
	"ДАННЫЕ СОП ДЛЯ ЭТОГО ДОКУМЕНТА ОТЛИЧАЮТСЯ" // устанавливаем заголовок. необязательно
	); 
КонецПроцедуры 

&НаКлиенте 
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Объект.ПассажирыВзрослые = Параметры.ПассажирыВзрослые;
		Объект.ПассажирыДети = Параметры.ПассажирыДети;
		Объект.ПассажирыМалыши = Параметры.ПассажирыМалыши;
		Объект.Почта = Параметры.Почта;
		Объект.Груз = Параметры.Груз;
		Объект.РучнаяКладь = Параметры.РучнаяКладь;
		Объект.Багаж = Параметры.Багаж;
		Сообщить("Данные успешно изменены"); 
	Иначе 
		Сообщить("Данные остались прежними"); 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УходЗапаснойАППриИзменении(Элемент)
	Если Объект.УходНаЗапаснойАП Тогда
		Элементы.ЗапаснойАП.Доступность = Истина;
	Иначе 
		Элементы.ЗапаснойАП.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НеприбылПриИзменении(Элемент)
	Если Объект.Неприбыл Тогда
		Элементы.ПричинаНеприбытия.Доступность = Истина;
	Иначе 
		Элементы.ПричинаНеприбытия.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	Если Объект.ЗадержкаПрилета Тогда
		Элементы.ПричинаОпоздания.Доступность = Истина;
	Иначе 
		Элементы.ПричинаОпоздания.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
